cmsis-svd/cmsis-svd/data/Nuvoton/NUC1262AE.svd
       <register derivedFrom="PDMA_DSCT0_CTL">
          <name>PDMA_DSCT1_CTL</name>
          <displayName>PDMA_DSCT1_CTL</displayName>
          <description>Descriptor Table Control Register of PDMA Channel n</description>
          <addressOffset>0x10</addressOffset>
       </register>
       <register derivedFrom="PDMA_DSCT0_CTL">
          <name>PDMA_DSCT2_CTL</name>
          <displayName>PDMA_DSCT2_CTL</displayName>
          <description>Descriptor Table Control Register of PDMA Channel n</description>
          <addressOffset>0x20</addressOffset>
       </register>
       <register derivedFrom="PDMA_DSCT0_CTL">
          <name>PDMA_DSCT3_CTL</name>
          <displayName>PDMA_DSCT3_CTL</displayName>
          <description>Descriptor Table Control Register of PDMA Channel n</description>
          <addressOffset>0x30</addressOffset>
       </register>
       <register derivedFrom="PDMA_DSCT0_CTL">
          <name>PDMA_DSCT4_CTL</name>
          <displayName>PDMA_DSCT4_CTL</displayName>
          <description>Descriptor Table Control Register of PDMA Channel n</description>
          <addressOffset>0x40</addressOffset>
       </register>
       <register derivedFrom="PDMA_DSCT0_CTL">
          <name>PDMA_DSCT5_CTL</name>
          <displayName>PDMA_DSCT5_CTL</displayName>
          <description>Descriptor Table Control Register of PDMA Channel n</description>
          <addressOffset>0x50</addressOffset>
       </register>
       <register derivedFrom="PDMA_DSCT0_CTL">
          <name>PDMA_DSCT6_CTL</name>
          <displayName>PDMA_DSCT6_CTL</displayName>
          <description>Descriptor Table Control Register of PDMA Channel n</description>
          <addressOffset>0x60</addressOffset>
       </register>
       <register derivedFrom="PDMA_DSCT0_CTL">
          <name>PDMA_DSCT7_CTL</name>
          <displayName>PDMA_DSCT7_CTL</displayName>
          <description>Descriptor Table Control Register of PDMA Channel n</description>
          <addressOffset>0x70</addressOffset>
       </register>
       <register derivedFrom="PDMA_DSCT0_CTL">
          <name>PDMA_DSCT8_CTL</name>
          <displayName>PDMA_DSCT8_CTL</displayName>
          <description>Descriptor Table Control Register of PDMA Channel n</description>
          <addressOffset>0x80</addressOffset>
       </register>
       <register derivedFrom="PDMA_DSCT0_CTL">
          <name>PDMA_DSCT9_CTL</name>
          <displayName>PDMA_DSCT9_CTL</displayName>
          <description>Descriptor Table Control Register of PDMA Channel n</description>
          <addressOffset>0x90</addressOffset>
       </register>
       <register>
          <name>PDMA_DSCT0_SA</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>PDMA_DSCT0_SA</displayName>
          <description>Source Address Register of PDMA Channel n</description>
          <addressOffset>0x4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>SA</name>
              <description>PDMA Transfer Source Address Register\nThis field indicates a 32-bit source address of PDMA controller.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="PDMA_DSCT0_SA">
          <name>PDMA_DSCT1_SA</name>
          <displayName>PDMA_DSCT1_SA</displayName>
          <description>Source Address Register of PDMA Channel n</description>
          <addressOffset>0x14</addressOffset>
       </register>
       <register derivedFrom="PDMA_DSCT0_SA">
          <name>PDMA_DSCT2_SA</name>
          <displayName>PDMA_DSCT2_SA</displayName>
          <description>Source Address Register of PDMA Channel n</description>
          <addressOffset>0x24</addressOffset>
       </register>
       <register derivedFrom="PDMA_DSCT0_SA">
          <name>PDMA_DSCT3_SA</name>
          <displayName>PDMA_DSCT3_SA</displayName>
          <description>Source Address Register of PDMA Channel n</description>
          <addressOffset>0x34</addressOffset>
       </register>
       <register derivedFrom="PDMA_DSCT0_SA">
          <name>PDMA_DSCT4_SA</name>
          <displayName>PDMA_DSCT4_SA</displayName>
          <description>Source Address Register of PDMA Channel n</description>
          <addressOffset>0x44</addressOffset>
       </register>
       <register derivedFrom="PDMA_DSCT0_SA">
          <name>PDMA_DSCT5_SA</name>
          <displayName>PDMA_DSCT5_SA</displayName>
          <description>Source Address Register of PDMA Channel n</description>
          <addressOffset>0x54</addressOffset>
       </register>
       <register derivedFrom="PDMA_DSCT0_SA">
          <name>PDMA_DSCT6_SA</name>
          <displayName>PDMA_DSCT6_SA</displayName>
          <description>Source Address Register of PDMA Channel n</description>
          <addressOffset>0x64</addressOffset>
       </register>
       <register derivedFrom="PDMA_DSCT0_SA">
          <name>PDMA_DSCT7_SA</name>
          <displayName>PDMA_DSCT7_SA</displayName>
          <description>Source Address Register of PDMA Channel n</description>
          <addressOffset>0x74</addressOffset>
       </register>
       <register derivedFrom="PDMA_DSCT0_SA">
          <name>PDMA_DSCT8_SA</name>
          <displayName>PDMA_DSCT8_SA</displayName>
          <description>Source Address Register of PDMA Channel n</description>
          <addressOffset>0x84</addressOffset>
       </register>
       <register derivedFrom="PDMA_DSCT0_SA">
          <name>PDMA_DSCT9_SA</name>
          <displayName>PDMA_DSCT9_SA</displayName>
          <description>Source Address Register of PDMA Channel n</description>
          <addressOffset>0x94</addressOffset>
       </register>
       <register>
          <name>PDMA_DSCT0_DA</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>PDMA_DSCT0_DA</displayName>
          <description>Destination Address Register of PDMA Channel n</description>
          <addressOffset>0x8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>DA</name>
              <description>PDMA Transfer Destination Address Register\nThis field indicates a 32-bit destination address of PDMA controller.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="PDMA_DSCT0_DA">
          <name>PDMA_DSCT1_DA</name>
          <displayName>PDMA_DSCT1_DA</displayName>
          <description>Destination Address Register of PDMA Channel n</description>
          <addressOffset>0x18</addressOffset>
       </register>
       <register derivedFrom="PDMA_DSCT0_DA">
          <name>PDMA_DSCT2_DA</name>
          <displayName>PDMA_DSCT2_DA</displayName>
          <description>Destination Address Register of PDMA Channel n</description>
          <addressOffset>0x28</addressOffset>
       </register>
       <register derivedFrom="PDMA_DSCT0_DA">
          <name>PDMA_DSCT3_DA</name>
          <displayName>PDMA_DSCT3_DA</displayName>
          <description>Destination Address Register of PDMA Channel n</description>
          <addressOffset>0x38</addressOffset>
       </register>
       <register derivedFrom="PDMA_DSCT0_DA">
          <name>PDMA_DSCT4_DA</name>
          <displayName>PDMA_DSCT4_DA</displayName>
          <description>Destination Address Register of PDMA Channel n</description>
          <addressOffset>0x48</addressOffset>
       </register>
       <register derivedFrom="PDMA_DSCT0_DA">
          <name>PDMA_DSCT5_DA</name>
          <displayName>PDMA_DSCT5_DA</displayName>
          <description>Destination Address Register of PDMA Channel n</description>
          <addressOffset>0x58</addressOffset>
       </register>
       <register derivedFrom="PDMA_DSCT0_DA">
          <name>PDMA_DSCT6_DA</name>
          <displayName>PDMA_DSCT6_DA</displayName>
          <description>Destination Address Register of PDMA Channel n</description>
          <addressOffset>0x68</addressOffset>
       </register>
       <register derivedFrom="PDMA_DSCT0_DA">
          <name>PDMA_DSCT7_DA</name>
          <displayName>PDMA_DSCT7_DA</displayName>
          <description>Destination Address Register of PDMA Channel n</description>
          <addressOffset>0x78</addressOffset>
       </register>
       <register derivedFrom="PDMA_DSCT0_DA">
          <name>PDMA_DSCT8_DA</name>
          <displayName>PDMA_DSCT8_DA</displayName>
          <description>Destination Address Register of PDMA Channel n</description>
          <addressOffset>0x88</addressOffset>
       </register>
       <register derivedFrom="PDMA_DSCT0_DA">
          <name>PDMA_DSCT9_DA</name>
          <displayName>PDMA_DSCT9_DA</displayName>
          <description>Destination Address Register of PDMA Channel n</description>
          <addressOffset>0x98</addressOffset>
       </register>
       <register>
          <name>PDMA_DSCT0_FIRST</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>PDMA_DSCT0_FIRST</displayName>
          <description>First Scatter-gather Descriptor Table Offset of PDMA Channel n</description>
          <addressOffset>0xC</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>FIRST</name>
              <description>PDMA First Descriptor Table Offset\nThis field indicates the offset of the first descriptor table address in system memory. \nWrite Operation:\nIf the system memory based address is 0x2000_0000 (PDMA_SCATBA), and the first descriptor table is started from 0x2000_0100, then this field must be filled with 0x0100.\nRead Operation:\nWhen operating in scatter-gather mode, the last two bits FIRST[1:0] will become reserved.\nNote 1: The first descriptor table address must be word boundary.\nNote 2: Before filled transfer task in the descriptor table, user must check if the descriptor table is complete.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NEXT</name>
              <description>PDMA Next Descriptor Table Offset\nThis field indicates the offset of next descriptor table address in system memory. \nNote: write operation is useless in this field.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
